# browsers
cask "firefox"
cask "google-chrome"

# gui tools
cask "iterm2"

# editor
brew "emacs"

# tools
brew "colordiff"
brew "gettext"
brew "imagemagick"
brew "jq"
brew "ripgrep"
brew "fd"
brew "tmux"
brew "watch"
brew "wget"
brew "parallel"
brew "editorconfig"
brew "direnv"
brew "cmigemo"
brew "fzf"
brew "zoxide"
brew "peco"
brew "percol"

# ghq
brew "ghq"

# vcs
brew "git"
brew "mercurial"
brew "subversion"
