# -*- mode: ruby -*-
#
# http://brew.sh/
#
# gem install brewdler

tap 'homebrew/dupes'
tap 'josegonzalez/homebrew-php'
tap 'phinze/cask'
brew 'brew-cask'

# servers
brew 'memcached'
brew 'mongodb'
brew 'mysql'
brew 'redis'

# programming languages
brew 'gauche'
brew 'go'
brew 'nodejs'
brew 'phantomjs'
brew 'php54'
brew 'python'
brew 'python3'
brew 'sbcl'

# vcs
brew 'git'
brew 'mercurial'
brew 'subversion'

# tools
brew 'colordiff'
brew 'emacs'
brew 'gettext'
brew 'imagemagick'
brew 'jq'
brew 'the_silver_searcher'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'parallel'
brew 'editorconfig'

# browser
cask 'firefox'
cask 'google-chrome'

# gui tools
cask 'emacs'
cask 'alfred'
cask 'cord'
cask 'cyberduck'
cask 'iterm2'
cask 'limechat'
