# tap
tap "motemen/ghq"

# browsers
cask "firefox"
cask "google-chrome"

# gui tools
cask "alfred"
cask "cord"
cask "cyberduck"
cask "iterm2"

# editor
brew "emacs"
cask "emacs"

# tools
brew "colordiff"
brew "gettext"
brew "imagemagick"
brew "jq"
brew "the_silver_searcher"
brew "tmux"
brew "reattach-to-user-namespace"
brew "watch"
brew "wget"
brew "parallel"
brew "editorconfig"
brew "direnv"
brew "cmigemo"
brew "ghq"

# vcs
brew "git"
brew "mercurial"
brew "subversion"
